{
  "company_info": {
    "name": "Our Grounds",
    "description": "Explore Conscious Wellness and Sustainable Products – Shop Online and Join Us in Building a Better Future!"
  },
  "products": [
    {
      "name": "Wellness(39)",
      "price": "R225,00",
      "url": "https://our-grounds.com/product/flu-combo/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/08/our-grounds-categories-1-1-300x300.webp"
    },
    {
      "name": "Wellness(39)",
      "url": "https://our-grounds.com/product-category/wellness/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/08/our-grounds-categories-1-1-300x300.webp"
    },
    {
      "name": "Raw Pro-Biotic Gut Repair",
      "price": "R225,00",
      "url": "https://our-grounds.com/product/raw-pro-biotic-gut-repair/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/08/vegan_probiotic.webp"
    },
    {
      "name": "Raw Pro-Biotic Gut Repair",
      "url": "https://our-grounds.com/product/raw-pro-biotic-gut-repair/"
    },
    {
      "name": "Bronchial Relief",
      "price": "R195,00",
      "url": "https://our-grounds.com/product/bronchial-relief/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/08/bronchial_relief.webp"
    },
    {
      "name": "Bronchial Relief",
      "url": "https://our-grounds.com/product/bronchial-relief/"
    },
    {
      "name": "Gut Fix Semosis™",
      "price": "R185,00",
      "url": "https://our-grounds.com/product/gut-fix-semosis/",
      "image": "https://our-grounds.com/wp-content/uploads/2025/04/image00001-scaled.jpeg"
    },
    {
      "name": "Gut Fix Semosis™",
      "url": "https://our-grounds.com/product/gut-fix-semosis/"
    },
    {
      "name": "Go Go Pain – Intense Pain Reliever",
      "price": "R185,00",
      "url": "https://our-grounds.com/product/go-go-pain-intense-pain-reliever/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/all_prouct_shots-1.webp"
    },
    {
      "name": "Go Go Pain – Intense Pain Reliever",
      "url": "https://our-grounds.com/product/go-go-pain-intense-pain-reliever/"
    },
    {
      "name": "Keep Growing",
      "price": "R135,00",
      "url": "https://our-grounds.com/product/keep-growing/",
      "image": "https://our-grounds.com/wp-content/uploads/2025/03/all_prouct_shots.png"
    },
    {
      "name": "Keep Growing",
      "url": "https://our-grounds.com/product/keep-growing/"
    },
    {
      "name": "Belly Bugs",
      "price": "R150,00",
      "url": "https://our-grounds.com/product/belly-bugs/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/12/bellybugs.webp"
    },
    {
      "name": "Belly Bugs",
      "url": "https://our-grounds.com/product/belly-bugs/"
    },
    {
      "name": "Huff & Puff",
      "price": "R150,00",
      "url": "https://our-grounds.com/product/huff-puff/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/12/huffpuff.webp"
    },
    {
      "name": "Huff & Puff",
      "url": "https://our-grounds.com/product/huff-puff/"
    },
    {
      "name": "Just Collagen",
      "price": "R420,00",
      "url": "https://our-grounds.com/product/just-collagen/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/just_collagen_product_shot_-2.webp"
    },
    {
      "name": "Just Collagen",
      "url": "https://our-grounds.com/product/just-collagen/"
    },
    {
      "name": "Anti-Viral & Bacterial",
      "price": "R215,00",
      "url": "https://our-grounds.com/product/anti-viral-bacterial/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds_product_flu_combo-2-1.webp"
    },
    {
      "name": "Anti-Viral & Bacterial",
      "url": "https://our-grounds.com/product/anti-viral-bacterial/"
    },
    {
      "name": "Flu Combo",
      "price": "R580,00",
      "url": "https://our-grounds.com/product/flu-combo/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/08/flu_combo.webp"
    },
    {
      "name": "Flu Combo",
      "url": "https://our-grounds.com/product/flu-combo/"
    },
    {
      "name": "Eye Repair",
      "price": "R310,00",
      "url": "https://our-grounds.com/product/eye-repair/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/13-1-1.webp"
    },
    {
      "name": "Eye Repair",
      "url": "https://our-grounds.com/product/eye-repair/"
    },
    {
      "name": "Night Care",
      "price": "R200,00",
      "url": "https://our-grounds.com/product/night-care/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/12-1-1.webp"
    },
    {
      "name": "Night Care",
      "url": "https://our-grounds.com/product/night-care/"
    },
    {
      "name": "Gut Fix 7 Day Program",
      "price": "R450,00",
      "url": "https://our-grounds.com/product/gut-fix-7-day-program/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds_shop_product_gut-fix-reset-1.webp"
    },
    {
      "name": "Gut Fix 7 Day Program",
      "url": "https://our-grounds.com/product/gut-fix-7-day-program/"
    },
    {
      "name": "8 Week Journey back to Wellness",
      "price": "R4000,00",
      "url": "https://our-grounds.com/product/8-week-journey-back-to-wellness/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds_8-week-logo-2-1.webp"
    },
    {
      "name": "8 Week Journey back to Wellness",
      "url": "https://our-grounds.com/product/8-week-journey-back-to-wellness/"
    },
    {
      "name": "Bespoke VIP Wellness nutrition plan with Dr Mel",
      "price": "R10000,00",
      "url": "https://our-grounds.com/product/bespoke-vip-wellness-nutrition-plan-with-dr-mel/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds_product-vip-retreat_product-1.webp"
    },
    {
      "name": "Bespoke VIP Wellness nutrition plan with Dr Mel",
      "url": "https://our-grounds.com/product/bespoke-vip-wellness-nutrition-plan-with-dr-mel/"
    },
    {
      "name": "Plant-Inspired Recipe Pack – Something for Lunch or Dinner",
      "price": "R80,00",
      "url": "https://our-grounds.com/product/plant-inspired-recipe-pack-something-for-lunch-or-dinner/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds-recipe_08-1.webp"
    },
    {
      "name": "Plant-Inspired Recipe Pack – Something for Lunch or Dinner",
      "url": "https://our-grounds.com/product/plant-inspired-recipe-pack-something-for-lunch-or-dinner/"
    },
    {
      "name": "Plant-Inspired Recipe Pack – Something for Breakfast",
      "price": "R80,00",
      "url": "https://our-grounds.com/product/plant-inspired-recipe-pack-something-for-breakfast/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds-recipe_06-1.webp"
    },
    {
      "name": "Plant-Inspired Recipe Pack – Something for Breakfast",
      "url": "https://our-grounds.com/product/plant-inspired-recipe-pack-something-for-breakfast/"
    },
    {
      "name": "Hydration Recipe Pack",
      "price": "R30,00",
      "url": "https://our-grounds.com/product/hydration-recipe-pack/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds-recipe_02-1.webp"
    },
    {
      "name": "Hydration Recipe Pack",
      "url": "https://our-grounds.com/product/hydration-recipe-pack/"
    },
    {
      "name": "Plant-Inspired Recipe Pack – Something for Dessert",
      "price": "R70,00",
      "url": "https://our-grounds.com/product/plant-inspired-recipe-pack-something-for-dessert/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds-recipe_07-1.webp"
    },
    {
      "name": "Plant-Inspired Recipe Pack – Something for Dessert",
      "url": "https://our-grounds.com/product/plant-inspired-recipe-pack-something-for-dessert/"
    },
    {
      "name": "Plant-Based Milk Recipe Pack",
      "price": "R50,00",
      "url": "https://our-grounds.com/product/plant-based-milk-recipe-pack/",
      "image": "https://our-grounds.com/wp-content/uploads/2024/10/our-grounds-recipe_05-1.webp"
    },
    {
      "name": "Plant-Based Milk Recipe Pack",
      "url": "https://our-grounds.com/product/plant-based-milk-recipe-pack/"
    }
  ],
  "pages": {
    "homepage": {
      "url": "https://our-grounds.com",
      "title": "Our Grounds - Our Grounds – Conscious Wellness and Sustainable Products for a Better, Heart-Centered Future.",
      "content": "Our Grounds - Our Grounds – Conscious Wellness and Sustainable Products for a Better, Heart-Centered Future. Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Search Top Sellers See All Gut Fix Semosis™ Gut Health , Products Under R250 R 185,00 Add to basket Bronchial Relief Products Under R250 , Respiratory Health R 195,00 Add to basket Raw Pro-Biotic Gut Repair Gut Health , Immunity , Products Under R250 R 225,00 Add to basket Go Go Pain – Intense Pain Reliever Bone, Joint & Muscle , Energy & Fitness , Products Under R250 R 185,00 Add to basket OG Remedies that have reached the public 00 0 last updated: Find stores Please enter a valid address View all stores Search Results Happy Customers ‘I love knowing that I’m choosing to support my gut first thing in the morning! It feels like I’m setting myself up for a goooood day!’ – Bea Hurter from The Happy Hormone Club Product – Gut Fix ‘Skeptical at best as I’ve tried nearly everything I soon noticed a change. Now after months of pain free treatment I can walk up stairs again and walk long distances without my cane. I only use it every now and again if I have over done it and strained my muscles.’ – Riana Pretorius Product – Go Go Pain ‘This stuff really works! The hair is really coming back and this is literally after 1 week of using it!’ – Anon Anti-Hairloss User Product – Magnesium Anti-Hairloss Stay Connected join our community for the latest updates, tips and launches within our range Say hello to the OG Wellness tincture range – yo Become an Agent with Our Grounds\n\nLooking for a ne What is bliss? \n\n#OurGrounds #Bliss #HolisticHealt Meet Justin, our inspiring business partner with a Follow on Instagram Submit Your Testimony Your e-mail address Become a Stockist Your e-mail address About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "about": {
      "url": "https://our-grounds.com/about-us/",
      "title": "About Us - Our Grounds",
      "content": "About Us - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Our Vision with community at our core is to connect, collaborate and rebuild a ‘whole’ new world. Heart centred and awakened. Our Mission is not only to grant everybody access to conscious wellness, but to eradicate poverty with our business ‘unusual’ approach; to show the current business world a blueprint to community building and heart centred collaboration. At Our Grounds Holdings, we see ourselves as more than just a business entity; we’re a driving force for transformative change and innovation across multiple industries, grounded in the principles of entrepreneurship and sustainability, transcending mere profit margins to tackle real-world challenges head-on. Through our embrace of a “business unusual” mindset, we’re not only disrupting conventional business models but also catalyzing genuine change in sectors ranging from wealth management to agriculture to housing, and beyond. This philosophy guides our expansion into diverse portfolios, showcasing a comprehensive understanding of the evolving needs of modern consumers and society at large. The rapid expansion and widespread presence of OG Wellness outlets underscore the growing demand for healing products and services. Simultaneously, our ventures into OG Marketing House, OG Investors Pool, and upcoming initiatives like OG Farming, OG Pets, and OG Construction demonstrate a multifaceted approach to achieving success. Our emphasis on handpicking top-tier guardians for each sector reflects our unwavering commitment to excellence, ensuring that we’re well-positioned to emerge as a key player not only in South Africa but on the global stage. As we continue to pioneer novel approaches and champion conscious consumerism, we’re poised to leave a lasting impact on both business landscapes and communities worldwide. Zoe Meyer Partner | Master Visionary Zoe Meyer is our Master Visionary and “Dream Weaver”. She fully embodies a business unusual leadership role and has been a business disruptor for several years within several organisations, some of which include Breadline, Oxfam, FourPaws, Doctors Without Borders, Green Peace, SA Fashion Week, and Vodacom, to mention a few. Zoe continues to groom and guide each individual who joins Our Grounds to own their services within a business as a business itself and has taught 100s of individuals to step into their own power and reach for their fullest potential in business. She holds a strong vision of collected perspectives to what the new world should look like as the master weaver of light frequency. Dr Melody Fourie Partner | Guardian of OG Wellness Mel Fourie is an IT Executive turned AADP Board Certified Holistic Health Practitioner. Mel joined the International Quantum University of Integrative Medicine and holds a Bachelor’s degree in Holistic Health Science, a Bachelor of Science in Holistic Nutrition and a Bachelor of Science in Botanical Medicine. She later continued her studies to incorporate a Master of Natural Medicine, a Doctorate in Alternative Medicine, and now continues her research venture towards a PhD in Natural Medicine. Founder of Nourished Well-Being, she remains in private practice TEACHING Living-Foods Functional Nutrition to people around the globe and remains dedicated to various specialities, some of which included: Transformational Nutrition Coaching, Holistic Cancer Speciality, Gut Health Speciality, Neuroscience and NLP, Quantum Medicine and more.. Mel is the Our Grounds ‘Guardian’, a Motivational Speaker, and an Educator, guiding the Our Grounds team, our clients and our Wellpreneurs with grace and her collective wisdom within a multitude of disciplines of the Medicine Arts.. Andre Slabbert Partner | Alchemist & Craft Medicine Maker Andre Slabbert is a Naturologist & Herbalist practicing Iridology & Sclerology, and is the founder of Natural Healing Knysna a family practice in Knysna serving individuals from near and far. Andre is well known for his passion of the healing arts, guiding individuals back to wellness holistically and as naturally as possible. Vida Heal and Semosis™ is manufactured by Natural Healing and offers a diversity of botanical and natural products for the treatment and support of various chronic illnesses and disorders. Vida Heal embodies the ethos of brining natural and affordable medicine to everyone seeking a more natural and sustainable way to heal the self. Justin Profe Partner | Business Expert Justin is our dynamic and charismatic business partner whose entrepreneurial spirit is both refreshing and invigorating. With years of experience in crafting effective strategies and pioneering sales techniques, he consistently brings innovative solutions to the table. His divine masculine presence brings a confidence matched by a genuine passion for the transformative power of natural medicine, driving his commitment to healing and improving lives on a global scale. Justin’s approach is not just about business acumen; it’s about blending expertise with a deep-seated belief in the potential of holistic wellness to make a real difference in the world. Dreamers, Visionaries & Healers of Our Grounds Paul Goosen Team Healer Elena Meyer Marketing & Advertising Advisor Raymond Meyer Procurement Advisor Elna Flawn Head Admin Bea Hurter Hormone Specialist About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "contact": {
      "url": "https://our-grounds.com/contact-us/",
      "title": "Contact Us - Our Grounds",
      "content": "Contact Us - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart +27 66 212 5373 info@our-grounds.com Natural Healing, Knysna, South Africa Cape Town, South Africa Satellite Office: 171 Blaauwberg rd, Table View, Cape Town 7441 Send us a message and we will contact you back Product Inquiry —Please choose an option— Bronchial Remedy Go Go Pain Gut Fix Theapeutic Magnesium Spray Wizard Skin Magic Join Our Team —Please choose an option— Direct Sales Agent Inquiry Sales Representative Inquiry Retailer Inquiry About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "shop": {
      "url": "https://our-grounds.com/shop/",
      "title": "Shop - Our Grounds",
      "content": "Shop - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Search Wellness (39) Services (3) Recipes (8) Top Products Raw Pro-Biotic Gut Repair Gut Health , Immunity , Products Under R250 R 225,00 Add to basket Bronchial Relief Products Under R250 , Respiratory Health R 195,00 Add to basket Gut Fix Semosis™ Gut Health , Products Under R250 R 185,00 Add to basket Go Go Pain – Intense Pain Reliever Bone, Joint & Muscle , Energy & Fitness , Products Under R250 R 185,00 Add to basket Latest Products Keep Growing Farming R 135,00 Add to basket Belly Bugs Gut Health R 150,00 Add to basket Huff & Puff Respiratory Health R 150,00 Add to basket Just Collagen Nutrition & Supplements R 420,00 Read more Anti-Viral & Bacterial Immunity , Products Under R250 R 215,00 Add to basket Flu Combo Immunity R 580,00 Add to basket Eye Repair Skin & Beauty R 310,00 Add to basket Night Care Products Under R250 , Skin & Beauty R 200,00 Add to basket Load More Services Gut Fix 7 Day Program Gut Health , Services R 450,00 Add to basket 8 Week Journey back to Wellness Services R 4000,00 Add to basket Bespoke VIP Wellness nutrition plan with Dr Mel Services R 10000,00 Add to basket Top Recipes Plant-Inspired Recipe Pack – Something for Lunch or Dinner Nutrition & Supplements , Products Under R250 , Recipes R 80,00 Add to basket Plant-Inspired Recipe Pack – Something for Breakfast Nutrition & Supplements , Products Under R250 , Recipes R 80,00 Add to basket Hydration Recipe Pack Nutrition & Supplements , Products Under R250 , Recipes R 30,00 Add to basket Plant-Inspired Recipe Pack – Something for Dessert Nutrition & Supplements , Products Under R250 , Recipes R 70,00 Add to basket Plant-Based Milk Recipe Pack Nutrition & Supplements , Products Under R250 , Recipes R 50,00 Add to basket Load More Search About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "shipping_and_deliveries": {
      "url": "https://our-grounds.com/shipping-and-deliveries/",
      "title": "Shipping and Deliveries - Our Grounds",
      "content": "Shipping and Deliveries - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Shipping and Deliveries Regrettably, we do not ship outside of RSA. Door to Door Service A courier service will collect the parcel from our warehouse in Knysna and deliver to your residence or place of work. When do I get my order? Deliveries are made during working hours. Normally, delivery can take anything from 24 to 72 hours (if you are in an outlying area). This does not include public holidays and weekends. Keep in mind that certain extreme outlying areas are only serviced by our courier on specific days of the week. We deliver during normal working hours. What is the cost? Courier Guy door to door service is R120 for parcels under 1,4 kg. A speciality courier service is required for parcels above 1,4 kg and may be invoiced at a courier specific fee. Regrettably, we do not ship outside of RSA. What are the benefits? Fast delivery that is done at your physical location – be it home or work. Can I track my order? Tracking details are sent via the orders email from orders@our-grounds.com. The tracking link will tell you when you are due to receive your order. Collections Service Upon placing your order, you can choose to collect from the offered collection point, currently being only the Natural Healing Knysna store, 19 Queen Street, Knysna. When do I get my order? Your order will be ready to collect within 2-3 working days. What is the cost? This is a free option. What are the benefits? Collect if it is convenient for you. Engages with a wellness practitioner while in-store. Can I track my order? Once your order status is changed to shipped, it means that your order is ready for collection. You can email orders@our-grounds.com to get a status update. About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "refund_policy": {
      "url": "https://our-grounds.com/refund-policy/",
      "title": "Refund Policy - Our Grounds",
      "content": "Refund Policy - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Refund Policy Our Grounds Holdings (Pty) Ltd Refunds & Returns Policy Please contact us at orders@our-grounds.com should you wish to request a refund & return your Our Grounds Online order. If you are not satisfied with your purchase, you may return it within 14 days for a refund, replacement or exchange if: You have the original invoice The item is unused The item is in its original, undamaged packaging Note: Refunds will be made via EFT. Certain items cannot be exchanged for safety and hygiene reasons Recipe packs and healing programs cannot be refunded. Defective goods can be returned within 1 month of the date of purchase if: You have the original invoice The goods have been used for their intended purpose and cared for as per the product instructions Note: You will have the choice to have returned goods replaced or refunded We reserve the right to send returned products for further assessment Please note that, due to the courier costs on our side, we are unfortunately unable to refund the R120 delivery fee should you choose to cancel your order. About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "terms_conditions": {
      "url": "https://our-grounds.com/terms-conditions/",
      "title": "Terms & Conditions - Our Grounds",
      "content": "Terms & Conditions - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Terms & Conditions Website Users may not access, display, use, download, and/or otherwise copy or distribute content obtained at www.our-grounds.com for marketing and other purposes without the consent of the provider. Electronic Communications By using this website or communicating with the provider by electronic means, the user consents and acknowledges that any and all agreements, notices, disclosures, or any other communication satisfies any legal requirement, including but not limited to the requirement that such communication should be in writing. E-Commerce & Privacy Our-grounds.com sells various products online. The use of any product or service bought from this website is at the purchaser’s risk. The purchaser/user indemnifies and holds the provider harmless against any loss, injury or damages that may be sustained as a result of using the products sold on the website. The private information required for executing the orders placed through the e-commerce facility, namely the user’s personal information and credit card details, delivery address and telephone numbers, will be kept in the strictest confidence by the provider and not sold or made known to third parties. Only the necessary information – that is the delivery address and contact phone number – will be made known to third parties delivering the product. Credit card details are not kept by the provider under any circumstances. The provider cannot be held responsible for security breaches occurring on the user’s electronic device (personal computer or other electronic device used to browse the website), which may result due to the lack of adequate virus protection software or spyware that the user may inadvertently have installed on his/her device. The provider will supply all goods to the delivery company in good order. The provider will not be held liable for the condition of goods arriving at the user’s chosen delivery address. Payment Gateway Credit Card Transactions are acquired by Yoco, a registered systems operator and payment gateway in South Africa. Card holders may go to Yoco Terms and Conditions to view Yoco’s security policy. Products and Availability Please note that the stock of all items on offer is limited. Our Grounds will make all reasonable attempts to ensure that special offers are brought to an end when stock runs out. If it happens that we are unable to fulfill any order at the advertised price because stock is sold out, we will inform you via email and you will be entitled to a reimbursement for the Rand value you have paid for the product. Refund and Return Policy The provision of goods and services is subject to availability. In cases of unavailability, the provider will refund the client in full within 30 days. The provider reserves the right to cancel an order for which payment has already been received. This may occur if stock is insufficient or the quality of goods ordered does not meet the provider’s standards. Should the provider exercise this right, the user will receive a full refund with no deductions. In the case of returns of orders by the client, the client will be liable for actual shipping costs incurred. Online Promotions Online promotional offers are available at the Our Grounds online store only. The offers are available at the indicated dates and times only, or while stocks last. Voucher codes cannot be used in conjunction with other promotions. Refunds will only be given on the sale price, not the original price. Online Clearance Sales Clearance sale items are end-of-line, and quantities are therefore limited and subject to availability as they will not be replenished. The customer acknowledges that all items on promotion are limited. Our Grounds will make all reasonable efforts to monitor stock levels and ensure that when stock is no longer available, promotional offers are removed from the website. Our Grounds, however, cannot guarantee the availability of stock. When items are no longer available after a customer has placed an order, Our Grounds will notify the customer and he or she will be entitled to a refund of any amount already paid by the customer for such items. Our Grounds makes all reasonable efforts to accurately reflect the availability of items on the website, however should there be any errors relating to availability of items, Our Grounds shall notify the customer of such error as soon as reasonably possible and offer a refund for any amount already paid. Competitions Clear instructions on how to enter will be supplied on the competitions page. Prizes are not redeemable for cash. The promoters of the competitions will be stipulated on the Our Grounds competitions page. The competitions are open to SA residents who are over 18 years of age. Our Grounds will attempt to contact winners via social media within one week of selecting the winner. If a winner cannot be contacted after 3 attempts or if sufficient identity verification is not provided, Our Grounds reserves the right to draw a replacement winner. The judges’ decision is final and no correspondence will be entered into. Should the promoters be unable, for any reason whatsoever, to supply the specified prizes, they reserve the right to substitute the advertised prize (or any element(s) of the advertised prize) for an equivalent value prize. If the promoters suspect foul play by any participant, they are entitled to disqualify the participant with immediate effect. The promoters’ decision regarding this matter is final, and no correspondence on this matter will be entertained. Newsletter Pop-Up Competitions Any user who enters an Our Grounds competition via a pop-up on the website will be required to submit his or her personal details (name and email address) and accept a tick box to subscribe to the Our Grounds newsletter for a valid entry. Users who opt-in will then be added to the Our Grounds newsletter database. Data will not be sold to or used by any third-party suppliers. Copyright and Intellectual Property Rights The provider provides certain information on the website. Content currently or anticipated to be displayed on this is provided by the provider, its affiliates and/or a subsidiary, or any other third party owners of such content, and includes but is not limited to literary works, musical works, artistic works, sound recordings, cinematograph films, sound and television broadcasts, program-carrying signals, published editions and computer programs (“the Content”). All such proprietary works, and the compilation of the proprietary works, are copyright the provider, its affiliates or subsidiaries, or any other third party owner of such rights (“the Owners”), and is protected by South African and international copyright laws. The providers reserve the right to make any changes to the website, content, or to products and/or services offered through the website at any time and without notice. All rights in and to the content are reserved and retained by the owners. Except as specified in these terms & conditions, the user is not granted a license or any other right including without limitation under copyright, trademark, patent or other intellectual property rights in or to the content. Limitation of Liability The website and all content on the website, including any current or future offer of products or services, is provided on an “as is” basis, and may include inaccuracies or typographical errors. The owners make no warranty or representation as to the availability, accuracy or completeness of the content. Neither provider nor any holding company, affiliate or subsidiary shall be held responsible for any direct or indirect special, consequential or other damage of any kind whatsoever suffered or incurred, related to the use of, or the inability to access or use the content or the website or any functionality thereof, or of any linked website, even if the provider is expressly advised thereof. Privacy: Casual Surfing The user may visit the website without providing any personal information. The website servers will in such instances collect the IP address of the user’s computer, but not the email address or any other distinguishing information. This information is aggregated to measure the number of visits, average time spent on the website, pages viewed, etc. The provider uses this information to determine use of the website, and to improve content thereon. The provider assumes no obligation to protect this information, and may copy, distribute or otherwise use such information without limitation. Choice of Law This website is controlled, operated and administered by the provider from its offices within the Republic of South Africa. Access to the website from territories or countries where the content or purchase of the products sold on the website is illegal is prohibited. The user may not use this website in violation of South African export laws and regulations. If the user accesses this website from locations outside of South Africa, that user is responsible for compliance with all local laws. These terms & conditions shall be governed by the laws of the Republic of South Africa, and the user consents to the jurisdiction of the Witwatersrand High Court in the event of any dispute. If any of the provisions of these terms & conditions are found by a court of competent jurisdiction to be invalid or unenforceable, that provision shall be enforced to the maximum extent permissible so as to give effect to the intent of these terms & conditions, and the remainder of these terms & conditions shall continue in full force and effect. These terms & conditions constitute the entire agreement between the provider and the user with regard to the use of the content and this website. Updating of These Terms & Conditions The provider reserves the rights to change, modify, add or remove from portions or the whole of these terms & conditions from time to time. Changes to these terms & conditions will become effective upon such changes being posted to this website. It is the user’s obligation to periodically check these terms & conditions at the website for changes or updates. The user’s continued use of this website following the posting of changes or updates will be considered notice of the user’s acceptance to abide by and be bound by these terms & conditions, including such changes or updates. About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "privacy_policy": {
      "url": "https://our-grounds.com/privacy-policy/",
      "title": "Privacy Policy - Our Grounds",
      "content": "Privacy Policy - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Privacy Policy We respect your privacy. We encourage you to read our privacy policy as this applies to you. Introduction Welcome to our privacy policy. We are Our Grounds Holdings (Pty) Ltd and this is our plan of action when it comes to protecting your privacy. We respect your privacy and take the protection of personal information very seriously. The purpose of this policy is to describe the way that we collect, store, use, and protect information that can be associated with you or another specific natural or juristic person and can be used to identify you or that person (personal information). The purpose of this policy is to describe the way that we handle your personal information. Audience This policy applies to you if you are: • a visitor to our website; or • a customer who has ordered products that we provide, either online, through an agent, or in-store; • a customer who signs up, and downloads and/or use one of our healing recipe packs or healing programs; • a customer who signs up to receive our newsletter; • a customer who has entered one of our promotional competitions. This policy applies to you under certain circumstances. Personal information Personal information includes: • certain information that we collect automatically when you visit our website; • certain information collected on registration (see below); • certain information collected on submission; and • optional information that you provide to us voluntarily (see below); but excludes: • information that has been made anonymous so that it does not identify a specific person; • permanently de-identified information that does not relate or cannot be traced back to you specifically; • non-personal statistical information collected and compiled by us; and • information that you have provided voluntarily in an open, public environment or forum including any blog, chat room, community, classifieds, or discussion board (because the information has been disclosed in a public forum, it is no longer confidential and does not constitute personal information subject to protection under this policy). Personal information includes information we collect (i) automatically when you visit our website, (ii) on registration, (iii) on submission, and (iv) from you voluntarily. It excludes (i) anonymous, (ii) de-identified, (iii) non-personal statistical, and (iv) public information. Common examples Common examples of the types of personal information which we may collect, and process include your: • identifying information – such as your name, date of birth, or identification number of any kind; • contact information – such as your phone number or email address; • address information – such as your physical or postal address; or • demographic information – such as your gender or marital status. Sensitive personal information Depending on the products or services that you require, we may also collect sensitive personal information including your: • financial information – such as your bank account details; • sensitive demographic information – such as your race or ethnicity; • medical information – such as information about your physical or mental health; • sexual information – such as information about your sex life or sexual orientation; • criminal information – such as information about your commission or alleged commission of any offense or about any related legal proceedings; • employment information – including your membership of a trade union; and • beliefs – including your political or religious beliefs. Acceptance Acceptance required You must accept all the terms of this policy when you order our products, enter promotional competitions, visit our website, sign up to our newsletter or download and/or use one of our healing recipe packs or healing programs. If you do not agree with anything in this policy, then you may not order our products, enter promotional competitions, visit our website, sign up to our newsletter or download and/or use one of our healing recipe packs or healing programs. You may not order our products or request our services if you do not accept this policy. Legal capacity You may not access our website or order our products or request our services if you are younger than 18 years old or do not have legal capacity to conclude legally binding contracts. Deemed acceptance By accepting this policy, you are deemed to have read, understood, accepted, and agreed to be bound by all of its terms. Your obligations You may only send us your own personal information or the information of another data subject where you have their permission to do so. Changes We may change the terms of this policy at any time by updating this web page. If you do not agree with the changes, then you must stop using the website, and our products or services. If you continue to use the website, or our products or services following notification of a change to the terms, the changed terms will apply to you, and you will be deemed to have accepted those updated terms. Collection On registration Once you register on our website, sign up for our newsletter, enter one of our promotional competitions or download and/or use one of our recipe packs or healing programs you will no longer be anonymous to us. You will provide us with certain personal information when you register on our website. This personal information will include: • your name and surname; • your email address; • your telephone number; • your company name, company registration number, and VAT number; • your postal address or street address; and • your username and password. We will use this personal information to fulfil your account, provide additional services and information to you as we reasonably think appropriate, and for any other purposes set out in this policy. We collect certain information on registration, when you register on our website, sign up for our newsletter, enter one of our promotional competitions or download and/or use one of our healing recipe packs or healing programs. On order or request When you order our products or request our services from us, you will be asked to provide us with additional information on a voluntary basis (products or services information). We collect certain information when you order our products or request our services from us. From browser We automatically receive and record internet usage information on our server logs from your browser, such as your Internet Protocol address (IP address), browsing habits, click patterns, version of software installed, system type, screen resolutions, colour capabilities, plug-ins, language settings, cookie preferences, search engine keywords, JavaScript enablement, the content and pages that you access on the website, and the dates and times that you visit the website, paths taken, and time spent on sites and pages within the website (usage information). Please note that other websites visited before entering our website might place personal information within your URL during a visit to it, and we have no control over such websites. Accordingly, a subsequent website that collects URL information may log some personal information. We collect certain information from your web browser, including your Internet usage information when you visit our website. Cookies For information on how we deal with Cookies, please refer to our privacy and cookies policy Web beacons Our website may contain electronic image requests (called a single-pixel gif or web beacon request) that allow us to count page views and to access cookies. Any electronic image viewed as part of a web page (including an ad banner) can act as a web beacon. Our web beacons do not collect, gather, monitor, or share any of your personal information. We merely use them to compile anonymous information about our website. We collect certain information from web beacons on our website to compile anonymous information about our website. Optional details You may also provide additional information to us on a voluntary basis (optional information). This includes content or products that you decide to upload or download from our website or when you enter competitions, take advantage of promotions, respond to surveys, order certain additional products or services, or otherwise use the optional features and functionality of our website. We collect certain optional information, that you provide when you upload or download content from our website or when you enter competitions, take advantage of promotions, respond to surveys, or register and subscribe for certain additional products or services. Recording calls We may monitor and record any telephone calls that you make to us unless you specifically request us not to. Purpose for collection We may use or process any products information, or optional information that you provide to us for the purposes that you indicated when you agreed to provide it to us. Processing includes gathering your personal information, disclosing it, and combining it with other personal information. We generally collect and process your personal information for various purposes, including: • products or services purposes – such as collecting orders or requests for and providing our products or services; • marketing purposes – such as pursuing lawful related marketing activities; • business purposes – such as internal audit, accounting, business planning, and joint ventures, disposals of business, or other proposed and actual transactions; and • legal purposes – such as handling claims, complying with regulations, or pursuing good governance. We may use your usage information for the purposes described above and to: • remember your information so that you will not have to re-enter it during your visit or the next time you access the website; • monitor website usage metrics such as total number of visitors and pages accessed; and • track your entries, submissions, and status in any promotions or other activities in connection with your usage of the website. We may use any of your personal information that you provide to us for the purposes that you indicated when you agreed to provide it to us. Consent to collection We will obtain your consent to collect personal information: • in accordance with applicable law; • when you provide us with any registration information or optional information. We will get your consent to collect your personal information in accordance with applicable law when you provide us with it. Use Our obligations We may use your personal information to fulfil our obligations to you. Messages and updates We may send administrative messages and email updates to you about the website. In some cases, we may also send you primarily promotional messages. You can choose to opt-out of promotional messages. OR We may send administrative messages and email updates to you about the website. We may wish to provide you with information about new products or services in which we think you may be interested. This means that in some cases, we may also send you primarily promotional messages. We will not send you promotional messages unless you have chosen to opt-into them. But, we may send you one message asking you to opt-into promotional messages without you having opted-into promotional messages. We may use your information to send you administrative messages and email updates to you regarding the website and for marketing purposes where lawful. Targeted content While you are logged into the website, we may display targeted adverts and other relevant information based on your personal information. In a completely automated process, computers process the personal information and match it to adverts or related information. We never share personal information with any advertiser unless you specifically provide us with your consent to do so. Advertisers receive a record of the total number of impressions and clicks for each advert. They do not receive any personal information. If you click on an advert, we may send a referring URL to the advertiser’s website identifying that a customer is visiting from the website. We do not send personal information to advertisers with the referring URL. Once you are on the advertiser’s website however, the advertiser is able to collect your personal information. We may use your information for targeted content in certain, specified instances. Disclosure Sharing We may share your personal information with: • other divisions or companies within the group of companies to which we belong so as to provide joint content and services like registration, for transactions and customer support, to help detect and prevent potentially illegal acts and violations of our policies, and to guide decisions about our products, services, and communications (they will only use this information to send you marketing communications if you have requested their products or services); • an affiliate, in which case we will seek to require the affiliates to honour this privacy policy; • our products or services providers under contract who help provide certain products or services or help with parts of our business operations, including fraud prevention, bill collection, marketing, technology services (our contracts dictate that these products or services providers only use your information in connection with the products or services they supply or services they perform for us and not for their own benefit); • credit bureaus to report account information, as permitted by law; • banking partners as required by credit card association rules for inclusion on their list of terminated merchants (in the event that you utilise the services to receive payments, and you meet their criteria); and • other third parties who provide us with relevant services where appropriate, including but not limited to Facebook or Google. • Suppliers and Third Parties when you enter any promotional competitions or download/use one of our recipe packs or healing programs. We may share your personal information with third parties for the purposes of fulfilling our obligations to you among other purposes. Regulators We may disclose your personal information as required by law or governmental audit. Law enforcement We may disclose personal information if required: • by a subpoena or court order; • to comply with any law; • to protect the safety of any individual or the general public; and • to prevent violation of our customer relationship terms. We may disclose personal information to third parties if required for legal reasons. No selling We will not sell personal information. No personal information will be disclosed to anyone except as provided in this privacy policy. Marketing purposes We may disclose aggregate statistics (information about the customer population in general terms) about the personal information to advertisers or business partners. Employees We may need to disclose personal information to our employees that require the personal information to do their jobs. These include our responsible management, human resources, accounting, audit, compliance, information technology, or other personnel. Change of ownership If we undergo a change in ownership, or a merger with, acquisition by, or sale of assets to, another entity, we may assign our rights to the personal information we process to a successor, purchaser, or separate entity. We will disclose the transfer on the website. If you are concerned about your personal information migrating to a new owner, you may request us to delete your personal information. Security We take the security of personal information very seriously and always do our best to comply with applicable data protection laws. Our hosting company will host our website in a secure server environment that uses a firewall and other advanced security measures to prevent interference or access from outside intruders. We authorize access to personal information only for those employees who require it to fulfil their job responsibilities. We implement disaster recover procedures where appropriate. Our website is hosted on a secure server and uses security measures to prevent interference by intruders. Accurate and up to date We will try to keep the personal information we collect as accurate, complete, and up to date as is necessary for the purposes defined in this policy. From time to time, we may request you to update your personal information on the website. You are able to review or update any personal information that we hold on you by accessing your account online, emailing us, or phoning us. Please note that in order to better protect you and safeguard your personal information, we take steps to verify your identity before granting you access to your account or making any corrections to your personal information. Please keep your personal information accurate and up to date by accessing your account online, emailing us, by phoning us. Retention We will only retain your personal information for as long as it is necessary to fulfil the purposes explicitly set out in this policy, unless: • retention of the record is required or authorised by law; or • you have consented to the retention of the record. During the period of retention, we will continue to abide by our non-disclosure obligations and will not share or sell your personal information. We may retain your personal information in physical or electronic records at our discretion. We will only retain your personal information for as long as is necessary. Transfer to another country We may transmit or transfer personal information outside of the country in which it was collected to a foreign country and process it in that country. Personal information may be stored on servers located outside the country in which it was collected in a foreign country whose laws protecting personal information may not be as stringent as the laws in the country in which it was collected. You consent to us processing your personal information in a foreign country whose laws regarding processing of personal information may be less stringent. We may transfer your personal information outside the country in which it was collected to a foreign country. Updating, removing, or deleting personal information You may choose to correct or update the personal information you have submitted to us, by clicking the relevant menu in any of the pages on our website or contacting us by phone or email. You may choose to delete your personal information and account. If you would like to delete your personal information and account, please send a request to info@our-grounds.com. We will then delete your personal information and account. We will not delete personal information which we are required by law to retain. You may choose to update or remove the personal information you have submitted to us. Limitation We are not responsible for, give no warranties, nor make any representations in respect of the privacy policies or practices of linked or any third-party websites. Enquiries If you have any questions or concerns arising from this privacy policy or the way in which we handle personal information, please contact us. Email Disclaimer The information contained in a Our Grounds Holdings (Pty) Ltd email and any attachments thereto may contain confidential, proprietary, and/or personal information. It is intended solely for the use by the addressee/intended recipient and should only be used by the addressee/intended recipient for the related purpose. If you are not the intended recipient of an email, you are requested to immediately notify us via return email and thereafter delete this email. Any disclosure, copying, reproduction or distribution of or any action taken or omitted in reliance on this information is prohibited and may be unlawful. The views expressed in an email, unless otherwise stated, are those of the sender and not those of Our Grounds Holdings (Pty) Ltd nor its management. Emails are not guaranteed to be secure or free of errors or viruses. No liability or responsibility is accepted for any interception, corruption, destruction, loss, tampering or interfering with any of the information contained in an email, nor any direct, indirect, special, or consequential damages arising from the use of any information contained in an email or any linked website. Our Grounds Holdings (Pty) Ltd specifically elects to not apply the provisions of the Electronic Communications and Transactions Act 25 of 2002 to the content and format of an email, unless expressly stated otherwise. Should the addressee/intended recipient wish to enter into an agreement based on the content of the email, a formal, written, signed agreement must be entered into. By sending email communications to Our Grounds Holdings (Pty) Ltd, you expressly consent to us processing any personal information contained in an email which will be done in accordance with the Protection of Personal Information Act (4 of 2013) (POPIA) and our Privacy Policy. Emails may contain confidential, proprietary, and/or personal information. By sending email communications to Our Grounds Holdings (Pty) Ltd, you expressly consent to us processing any personal information contained in an email which will be done in accordance with POPIA. About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "become_a_stockist": {
      "url": "https://our-grounds.com/become-a-stockist/",
      "title": "Become a Stockist - Our Grounds",
      "content": "Become a Stockist - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Become a Stockist Become a Stockist for Our Grounds Join the Our Grounds family and bring our premium products to your store! Interested in becoming a stockist? Simply click the banner below and fill out the quick form. We can’t wait to partner with you Hold crtl to select multiple products you are interested in stocking Flu Combo Anti Viral Bacterial Night Care Eye Repair Day Care Aloe Gel Facial Cleanser Skin Therapy Mystic Temple Luxury Incense Masala Chai Luxury Incense Flat Wooden Brass Inlay Incense Holder Maharani Dream Luxury Incense Backflow Incense Cone Burner Incense Burner White Sage Incense Cones Palo Santo Incense Cones White Sage Lavender Incense Cones Prostate Tincture Plant-Based Butter Recipe Pack Plant-Based Milk Recipe Pack Plant-Inspired Recipe Pack: Something for Breakfast Plant-Inspired Recipe Pack: Something for Dessert Plant-Inspired Recipe Pack: Something for Lunch or Dinner Ocean-Inspired Recipe Pack Healing Ferments Recipe Pack Hydration Recipe Pack Therapeutic Magnesium Oil Spray: Anti-Hair Loss Therapeutic Magnesium Oil Spray: Sleep Therapy Bronchial Relief Therapeutic Magnesium Oil Spray: Sensitive Skin Woman's Algorithm Therapeutic Magnesium Oil Spray: Pure Therapeutic Magnesium Oil Spray: Immune Support Therapeutic Magnesium Oil Spray: Arthritis Therapeutic Magnesium Oil Spray: Mental Clarity Stress & Anxiety Support Go-Go Pain Massage Lotion Go-Go Pain Intense Pain Reliever Therapeutic Magnesium Oil Spray: Active Muscle Recovery Acidosis pH Control Maagkwaal Semosis Raw Pro-Biotic Gut Repair Gut Fix Semosis About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "farming": {
      "url": "https://our-grounds.com/farming/",
      "title": "Farming - Our Grounds",
      "content": "Farming - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Under Exploration About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "community": {
      "url": "https://our-grounds.com/community/",
      "title": "Community - Our Grounds",
      "content": "Community - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Are you a part of the OG Community? OG Community is a space where we launch sustainable campaigns that empower and uplift all parts of community. We invite you to have a look at the first campaign below and see how you can get involved Click here About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    },
    "testimonials": {
      "url": "https://our-grounds.com/testimonials/",
      "title": "Testimonials - Our Grounds",
      "content": "Testimonials - Our Grounds Skip to content Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart Shop Blog About Us Contact Shop Blog About Us Contact Store Locator Login Cart Store Locator Login Cart R 0,00 0 Cart R 0,00 0 Cart Testimonials Add your testimonial Name Email Testimonial Send Testimonials I moved to Broederstroom area couple of weeks ago and have been struggling with khakibush and black jacks... in other words in the bush all the time and subsequently got many ticks crawling and latching on...3 bites plus all kinds of biting goggas. A couple of days ago I decided to put GoGo Pain on and see if these crawlies would still climb on me. They stopped!! Must be the eucaluptus? Anyway now there is a natural chemical free bug control benefit apart from all the other benefits of GoGo Pain Anon Go Go Pain This is to tell you that I am getting immense pain relief from your cream!! It is unbelievable!! I am prepared to do a free advertising spot for you to recommend your amazing cream!! Still recovering but at a greater pace thanks to this awesome cream. Anon Go Go Pain my husband used to suffer from constipation after we started drinking gut fix the problem was solved we love it so much I don’t think we will ever live without it…..no constipation from both of us we are free thank you Anon Gutfix My Hubby has lost that “ bloated “ feeling and I love spicy food and now feel like my tummy doesn’t have that “burning” feeling after a spicy meal. Also, I had a terrible bout of gastric flu, and I started taking it from the 4th day in-after the first dose I saw an immediate improvement, and within one day of dosing I was 70% better. Anon Gutfix I have been diagnosed with PCOS for 15 years and have always struggled with my gut health. Since taking Gut Fix I have noticed a significant improvement in bloating, inflammation, general digestion, and weight loss. I have taken probiotics before, with 50 billion CFU’s, and I haven’t experienced the same benefits as I have with Gut Fix. It is also a much more affordable than the probiotics available in stores. I am so grateful for this product Anon Gutfix Helen came down with Pneumonia and almost died, if it wouldn't have been for our Bronchial Probiotic. The doctor basically said it saved her life.. I wish Helen speedy recovery. Anon I received my products on Friday, and started using Bronchial relief immediately. My chest was very closed and I “coughed my lungs out” not getting enough oxygen. Within 15 minutes I was breathing far better, and the cough subsided. \nAwesome product ! May Smith-Ehlers I have been rubbing Go Go Pain on my sore and stiff\nwrists and it has really helped soothe my pain. Yolande Glenlily The Mental Clarity Magnesium Spray has offered me a clear mind and I love the clean, fresh smell of the pairing essential oils, this is a great way to supplement with magnesium while benefiting from the therapeutic\neffects at the same time Helen Saayman I could not beleive how effective the Arthritis and Joint Pain Magensium spray is. I found almost Immediate\nrelief. Geoff Go Go Pain works like a bomb, my back ache is no longer a problem and I don't need my back brace\neither Rodney Swartz “My mom is 86 and suffers from fibromyalgia. A friend gave her a jar. She's\nbeen wearing a hand brace for years. Since using it she hasn't worn it once.\nLike she says she knows it's not a cure but the fact she has no pain is enough\nfor her Anon Go Go Pain Good morning! I just want to share with you all....\nFor the first time, I have winter's hands and feet... I went to the pharmacy to\nask them what it is, and they gave me camphor cream with grandpas.\nAfter a day of using it and not feeling any results. The light went on, and I\nrealized that I have 7 Go Go Pain in my practice! And voila, after the 2nd\napplication, I can truly say it is the best solution for winter's hands and feet.\nNO MORE PAIN, NO MORE ITCHING, NO MORE SWELLING!!! Karin Go Go Pain Just some feedback and a different way of using Go Go Pain- I came down\nwith a head cold the last couple of days, and woke up last night with\nthrobbing sinuses. I have already started using the Antiviral drops, but the\npain was intense. I decided today to rub some Go Go Pain over my sinus\ncavities as well as on my neck along the sore throat - and the difference is\nimmense!\nI am sure all the amazing ingredients in there will also work to reduce the\ninflammation in my unhappy sinuses! Anon Go Go Pain Hi. This GoGo Pain is absolutely amazing, yesterday I could not take the pain\nanymore from abscess at front of my nose, went to chemist for anything\nthat would help, told schedule 4 cream, drs prescription, came home\ndevastated, so I took GoGo & stuffy nose with it, miracle happened, today no\npain, abscess broke, I cannot believe the difference. This is the most\nincredible healing iv experienced. Anon Go Go Pain “I just want to report to you how outstanding the Go Go Pain cream has\nhelped my leg heal. I am most impressed. I can actually see the bruising\ndisappear like magic day by day. It helped tremendously with the pain as\nwell.”\n“Had terrible neuropathic pain in my left arm last night and could not get to\nsleep. Got up and rubbed in go go and within 10 mins pain gone and I slept\nright through the night. Good stuff!! Anon Go Go Pain I can not be without GoGo Pain... it works for anything and everything Anon Go Go Pain This morning I woke up with so much pain between my shoulder blades.\nMike rubbed your cream on. And I am so much better. Thank you for the\ncream. It works. Anon Go Go Pain This product is fabulous. Testimonials: Everyone is looking for a miracle in a\njar. This product is actually it. And I've tried at least 15 brands promising the\nsame thing and not quite delivering Michelle Go Go Pain The new COVID variant was no joke as it went hand in hand with the worst\nstomach I have ever experienced. After 4 weeks of every possible medication,\nincluding specialized stomach antibiotics I could not shake it. By chance I\ncame across a friend's post on Facebook, who used Gut Fix and I was at the\npoint that I would do anything to be back in good health. I contacted\nChantelle and after she consulted with a doctor that works with her, I was\ngiven the miracle that I was waiting for. Gut Fix and Raw Probiotic – Gut\nRepair, the combination worked in the most spectacular way. After 2 days I\nwas returned back to normal Gut function and I was healed. This Stuff is\nMagic and I will make sure to always have stock – just in case I ever need it\nagain. Thank You ! Anon GutFix Semosis Testimonial of happy client had a very high blood pressure when he went for\nhis medical at work reading as 230 / 190 nd 260 / 210 he drank tot glass gut\nfix every meal time nd he blood pressure is back to normal still using the gut\nfix and is very impressed and happy with the product Anon Gutfix My husband used to suffer from constipation after we started drinking gut\nfix the problem was solved we love it so much I don’t think we will ever live\nwithout it…..no constipation from both of us we are free thank you 󰚥 Gutfix Anon Gutfix “We found all our December guests dosing off our bottle because it’s so good\nand just seemed to settle their tummies after all the rich foods! We find that\nour gut health has tremendously improved, Hubby has lost that “ bloated “\nfeeling and I love spicy food and now feel like my tummy doesn’t have that\n“burning” feeling after a spicy meal. Also , I had a terrible bout of gastric flu,\nand I started taking it from the 4th day in-after the first dose I saw an\nimmediate improvement, and within one day of dosing I was 70% better. My\nniece also has a serious gastric flu at the moment and there were not\nenough hospital beds to admit her, i sent her some and also with 1 day of\ndosing she is now on the mend-the second bottle I am ordering is for her.” Anon Gutfix I bought a bottle of Gut Fix, within 2 days of using it I had normal bowel\nmovements. Currently doing the chronic dosage 30ml, 3x a day before meals.\nAll bloating is gone! Over the past 7 years I have tried many different\nprobiotics. No one has given me any relief from my IBS symptoms. I have had\nIBS-constipation since I was 3 years old, with anxiety. This feels like a total\nweight off my shoulders! I wake up in the morning and I need to go. I have\nbreakfast. Not long! I need to go. I will keep you posted about my progress\nthis month on Gut Fix. Anon Gutfix “My hubby went off to Somerset West for the Junior Nationals for Underwater\nHockey before Easter, and was exposed to a variety of ‘unusual’ foods on the\ntrip and came home with severe stomach issues and migraine headaches.\nAfter two weeks I coaxed him to try my Gut Fix and within 24 hours, my\nstomach settled and the blurred vision and headaches ceased. He has now\nbeen 7 days clear, his tummy is back to normal and he is a convert! � Anon Gutfix There is a guy here at work, he bought Gut fix, Dr said he has a helicobacter ,\nthe Dr always treats with Antibiotics, but after has finished the course it\ncomes back. Since now is using the Gut Fux is feeling better 🙏 balanced\nstomach Anon Gutfix The new COVID variant was no joke as it went hand in hand with the worst\nstomach I have ever experienced. After 4 weeks of every possible medication,\nincluding specialized stomach antibiotics I could not shake it. By chance I\ncame across a friend's post on Facebook, who used Gut Fix and I was at the\npoint that I would do anything to be back in good health. I contacted\nChantelle and after she consulted with a doctor that works with her, I was\ngiven the miracle that I was waiting for. Gut Fix and Raw Probiotic – Gut\nRepair, the combination worked in the most spectacular way. After 2 days I\nwas returned back to normal Gut function and I was healed. This Stuff is\nMagic and I will make sure to always have stock – just in case I ever need it\nagain. Thank You ! Anon Vegan Raw Probiotic I took the raw probiotic - amazing Anon Vegan Raw Probiotic This mixture is worth every cent. My coughing has subsided dramatically. I\nstill cough but at fewer intervals and it is not as intense. Thanks Chantelle\nGod bless you. Anon Bronchial Remedy I suddenly experienced a tight chest and wheezing as from yesterday\nafternoon. Dosed myself with some Bronchial Relief and could actually sleep\nlast night and feel much better. Very happy with this product. Anon Bronchial Remedy Heya. My chest is basically healed. I think. Just have to cough up the\nremaining congestion which is sore because my abs are finished from all the\ncoughing already. Lol. Thank you again. That stuff really works Anon Bronchial Remedy The arthritis spray is great and has made a difference. Thank you Anon Magnesium Sprays | Arthritis Joint Pain This is AMAZING! I bought it a few weeks ago, as I suffered severe hair loss\nand dry scalp. After 4 applications, my hair looks extremely healthy, my scalp\nis sorted out, and my hair is definitely falling out less. I highly recommend it.\nEven my hairdresser was in awe when she saw me on Saturday. Karyn Magnesium Sprays | Anti Hair Loss John Doe CEO About Us Shop Testimonials Store Locator My Account Privacy Policy Cookies Policy Disclaimers Refunds Policy Shipping and Deliveries Terms and Conditions Manufactured by Natural Healing Knysna© 2024 Distributed by Our Grounds Holdings (Pty) Ltd© 2024. All Rights Reserved Powered by Hostify Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Privacy Policy | Cookies Policy | Disclaimers | Refunds Policy | Shipping and Deliveries | Terms and Conditions Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Home Shop About Us Contact Us Blog Store Locator —— My account Cart —— Wellness Spirit Marketing Investors Pool Community Tech Farming Powered by Hostify"
    }
  },
  "navigation": [
    {
      "text": "Shop",
      "url": "https://our-grounds.com/shop/"
    },
    {
      "text": "Blog",
      "url": "https://our-grounds.com/blog/"
    },
    {
      "text": "About Us",
      "url": "https://our-grounds.com/about-us/"
    },
    {
      "text": "Contact",
      "url": "https://our-grounds.com/contact-us/"
    },
    {
      "text": "Store Locator",
      "url": "https://our-grounds.com/yith-store-locator/"
    },
    {
      "text": "Login",
      "url": "https://our-grounds.com/my-account/"
    },
    {
      "text": "Cart",
      "url": "https://our-grounds.com/cart/"
    },
    {
      "text": "Home",
      "url": "https://our-grounds.com/"
    },
    {
      "text": "Wellness",
      "url": "https://our-grounds.com/product-category/wellness/"
    },
    {
      "text": "Spirit",
      "url": "https://our-grounds.com/product-category/spirit/"
    },
    {
      "text": "Marketing",
      "url": "https://our-grounds.com/marketing/"
    },
    {
      "text": "Investors Pool",
      "url": "https://our-grounds.com/investors-pool/"
    },
    {
      "text": "Community",
      "url": "https://our-grounds.com/community/"
    },
    {
      "text": "Tech",
      "url": "https://our-grounds.com/tech/"
    },
    {
      "text": "Farming",
      "url": "https://our-grounds.com/farming/"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    },
    {
      "text": "——",
      "url": "https://our-grounds.com"
    }
  ],
  "contact_info": {
    "emails": [
      "info@our-grounds.com"
    ],
    "addresses": [
      "Satellite Office: 171 Blaauwberg rd, Table View, Cape Town 7441"
    ]
  },
  "social_media": [],
  "images": [],
  "blog_posts": [
    {
      "title": "A Root Cause Approach to Hormonal Health",
      "url": "https://our-grounds.com/a-root-cause-approach-to-hormonal-health/",
      "excerpt": "With Our Grounds & The Happy Hormone Club Hormones are your body’s chemical messengers, playing a key role in everything from energy levels and mood",
      "date": "April 11, 2025"
    },
    {
      "title": "A Root Cause Approach to Hormonal Health",
      "url": "https://our-grounds.com/a-root-cause-approach-to-hormonal-health/",
      "excerpt": "With Our Grounds & The Happy Hormone Club Hormones are your body’s chemical messengers, playing a key role in everything from energy levels and mood",
      "date": "April 11, 2025"
    },
    {
      "title": "A Root Cause Approach to Hormonal Health",
      "url": "https://our-grounds.com/a-root-cause-approach-to-hormonal-health/",
      "excerpt": "With Our Grounds & The Happy Hormone Club Hormones are your body’s chemical messengers, playing a key role in everything from energy levels and mood",
      "date": "April 11, 2025"
    },
    {
      "title": "A Root Cause Approach to Hormonal Health",
      "url": "https://our-grounds.com/a-root-cause-approach-to-hormonal-health/",
      "excerpt": "With Our Grounds & The Happy Hormone Club Hormones are your body’s chemical messengers, playing a key role in everything from energy levels and mood",
      "date": "April 11, 2025"
    },
    {
      "title": "The Ultimate 100% Natural Facial Care Routine: Nourish Your Skin with Pure Ingredients",
      "url": "https://our-grounds.com/the-ultimate-100-natural-facial-care-routine-nourish-your-skin-with-pure-ingredients/",
      "excerpt": "In a world where most products are full of synthetic chemicals and harsh toxins, it’s no wonder many of us are in need of natural skincare solutions that will actually nourish and heal our skin without using any harmful ingredients. Remember, our skin is our largest organ, and it deserves the gentlest, best care. That’s why we’ve decided to craft together a facial care routine using Our Grounds’ 100% natural, toxin-free ingredients to help your skin look and feel its best……naturally.",
      "date": "March 18, 2025"
    },
    {
      "title": "The Ultimate 100% Natural Facial Care Routine: Nourish Your Skin with Pure Ingredients",
      "url": "https://our-grounds.com/the-ultimate-100-natural-facial-care-routine-nourish-your-skin-with-pure-ingredients/",
      "excerpt": "In a world where most products are full of synthetic chemicals and harsh toxins, it’s no wonder many of us are in need of natural skincare solutions that will actually nourish and heal our skin without using any harmful ingredients. Remember, our skin is our largest organ, and it deserves the gentlest, best care. That’s why we’ve decided to craft together a facial care routine using Our Grounds’ 100% natural, toxin-free ingredients to help your skin look and feel its best……naturally.",
      "date": "March 18, 2025"
    },
    {
      "title": "The Future of Farming: Natural Solutions for Bigger Yields",
      "url": "https://our-grounds.com/the-future-of-farming-natural-solutions-for-bigger-yields/",
      "excerpt": "The Future of Farming: Natural Solutions for Bigger Yields At Our Grounds, we work alongside incredible natural medicine makers for your plants and soil. What",
      "date": "March 7, 2025"
    },
    {
      "title": "The Future of Farming: Natural Solutions for Bigger Yields",
      "url": "https://our-grounds.com/the-future-of-farming-natural-solutions-for-bigger-yields/",
      "excerpt": "The Future of Farming: Natural Solutions for Bigger Yields At Our Grounds, we work alongside incredible natural medicine makers for your plants and soil. What",
      "date": "March 7, 2025"
    },
    {
      "title": "A Spotlight on BSR",
      "url": "https://our-grounds.com/a-spotlight-on-bsr/",
      "excerpt": "Unless we recognise that every illness is multi-faceted we will often only manage symptoms. Investigating the deeply hidden root causes and integrating several types of",
      "date": "May 5, 2024"
    },
    {
      "title": "A Spotlight on BSR",
      "url": "https://our-grounds.com/a-spotlight-on-bsr/",
      "excerpt": "Unless we recognise that every illness is multi-faceted we will often only manage symptoms. Investigating the deeply hidden root causes and integrating several types of",
      "date": "May 5, 2024"
    },
    {
      "title": "Medicine from the garden -with Andre",
      "url": "https://our-grounds.com/medicine-from-the-garden-with-andre/",
      "excerpt": "Today we are having a look at Basil. The name meaning ‘King’, this plant truly is the ‘King’ of herbs. Relatively easy to grow in",
      "date": "February 10, 2024"
    },
    {
      "title": "Medicine from the garden -with Andre",
      "url": "https://our-grounds.com/medicine-from-the-garden-with-andre/",
      "excerpt": "Today we are having a look at Basil. The name meaning ‘King’, this plant truly is the ‘King’ of herbs. Relatively easy to grow in",
      "date": "February 10, 2024"
    },
    {
      "title": "NEW YEAR NEW CAREER?",
      "url": "https://our-grounds.com/new-year-new-career/",
      "excerpt": "Often times we jump into a career because it seems to be the ‘right thing to do’, but that doesn’t necessarily lead to a life",
      "date": "January 20, 2024"
    },
    {
      "title": "NEW YEAR NEW CAREER?",
      "url": "https://our-grounds.com/new-year-new-career/",
      "excerpt": "Often times we jump into a career because it seems to be the ‘right thing to do’, but that doesn’t necessarily lead to a life",
      "date": "January 20, 2024"
    },
    {
      "title": "Building balance through setting priorities",
      "url": "https://our-grounds.com/building-balance-through-setting-priorities/",
      "excerpt": "The difference between self-love and selfish is a perspective based topic that has been discussed for years. This month and every month going forward we",
      "date": "January 10, 2024"
    },
    {
      "title": "Building balance through setting priorities",
      "url": "https://our-grounds.com/building-balance-through-setting-priorities/",
      "excerpt": "The difference between self-love and selfish is a perspective based topic that has been discussed for years. This month and every month going forward we",
      "date": "January 10, 2024"
    },
    {
      "title": "Looking back at 2023",
      "url": "https://our-grounds.com/looking-back-at-2023/",
      "excerpt": "From reclaiming our inner sovereignty to manifesting our wildest dreams – this is the year we stopped talking about the brave new world and instead",
      "date": "December 31, 2023"
    },
    {
      "title": "Looking back at 2023",
      "url": "https://our-grounds.com/looking-back-at-2023/",
      "excerpt": "From reclaiming our inner sovereignty to manifesting our wildest dreams – this is the year we stopped talking about the brave new world and instead",
      "date": "December 31, 2023"
    },
    {
      "title": "A different perspective on December",
      "url": "https://our-grounds.com/a-different-perspective-on-december/",
      "excerpt": "Winter represents a time to hibernate and retreat inwards, while Spring allows us to plant the seeds of new thought for new manifestations. Summer is",
      "date": "December 1, 2023"
    },
    {
      "title": "A different perspective on December",
      "url": "https://our-grounds.com/a-different-perspective-on-december/",
      "excerpt": "Winter represents a time to hibernate and retreat inwards, while Spring allows us to plant the seeds of new thought for new manifestations. Summer is",
      "date": "December 1, 2023"
    },
    {
      "title": "Spotlight on the ‘modern day wizards & witches’",
      "url": "https://our-grounds.com/spotlight-on-the-modern-day-wizards-witches/",
      "excerpt": "We have been watching a big shift in our country towards ‘alternative healing’. In cases where we would’ve just gone to another Doctor for another",
      "date": "November 20, 2023"
    },
    {
      "title": "Spotlight on the ‘modern day wizards & witches’",
      "url": "https://our-grounds.com/spotlight-on-the-modern-day-wizards-witches/",
      "excerpt": "We have been watching a big shift in our country towards ‘alternative healing’. In cases where we would’ve just gone to another Doctor for another",
      "date": "November 20, 2023"
    }
  ]
}